Repository: floretcl/Kana-Torii-UIKit
Catalog: *.lproj/Localizable.strings
Languages: fr

source: Hiragana reading lessons
fr: Leçons de lecture d'Hiragana

source: Katakana reading lessons
fr: Leçons de lecture de Katakana

source: Hiragana writing lessons
fr: Leçons d'écriture d'Hiragana

source: Katakana writing lessons
fr: Leçons d'écriture de Katakana

source: Reading
fr: Lecture

source: Part
fr: Partie

# EndOfLearning
source: End of learning, now it's a noted test
fr: À partir de maintenant c'est un test noté

source: Writing
fr: Écriture

source: Good answer !
fr: Bonne réponse !

source: Wrong answer
fr: Mauvaise réponse

source: Your Score
fr: Votre Score

source: Back
fr: Retour

source: Translate Hiragana to Romaji
fr: Traduire le Hiragana en romaji

source: Translate Katakana To Romaji
fr: Traduire le Katakana en romaji

# FindCorrectRomajiForHiragana
source: Find correct Romaji
fr: Trouve le bon romaji

# FindCorrectRomajiForKatakana
source: Find correct Romaji
fr: Trouve le bon romaji

# FindCorrectHiraganaForRomaji
source: Find correct Hiragana
fr: Trouve le bon Hiragana

# FindCorrectKatakanaForRomaji
source: Find correct Katakana
fr: Trouve le bon Katakana

# TranslateRomajiToHiragana
source: Translate to Hiragana
fr: Traduit en Hiragana

# TranslateRomajiToKatakana
source: Translate to Katakana
fr: Traduit en Katakana

# Perfect
source: Perfect, that's it
fr: Parfait, c'est ça!!

# VeryGood
source: Very Good, just a little more effort
fr: Très bien, encore un petit effort!

# Good
source: Good, continue to learn
fr: Bien, continue à apprendre

# GoodEnough
source: Good enough, try to repeat lessons
fr: Pas mal, n'hésite pas à repéter encore les leçons

# NotTooBad
source: Not too bad but you still have to learn
fr: Pas mauvais mais il faut encore apprendre

# Bad
source: Pretty Bad, return to lessons
fr: C'est plutôt mauvais, retourne aux leçons

source: Error
fr: Erreur

source: Lesson
fr: Leçon

source: Auto-Detection failed
fr: Auto-détection échouée

# ManualCorrection
source: Manual correction : Look at the correction to see if your right
fr: Correction manuel : Regarde la correction pour voir si tu as juste

# SeeCorrection
source: Hold to see correction
fr: Maintenir pour voir la correction

# AboutKana
source: To write and read Japanese, we use Kana and Kanji, what interests us here are Kana. They are syllabaries, which means that the Japanese language does not have an alphabet in the form we know, for most of us. Hiragana and katakana are equivalent in their "simple" form to a two-letter syllable, except for the "n". In their simple form, hiragana and katakana consist of 46 characters of different writing with identical pronociations. To write these characters, there is a specific order of the lines, very important. The Hiragana are used to write the typical Japanese words and the Katakana the words of foreign origin.
fr: Pour écrire et lire le japonais, on utilise les Kana et les Kanji, ce qui nous intéressent ici ce sont les Kana. Ce sont des syllabaires, ce qui veut dire que la langue japonaise n'a pas d'alphabet dans le forme que nous connaissons, pour la plupart d'entre nous. Les Hiragana et Katakana équivalent pour leur forme "simple" à une syllabe de deux lettre, à l'exception du "n". Dans leur forme simple, les Hiragana et Katakana comportent 46 caractères d'écriture différente dont les prononciations sont identiques. Pour écrire ces caractères, il y a un ordre des traits déterminé, très important. Les Hiragana servent à écrire les mots typiquement japonais et les Katakana les mots d'origine étrangère.

# Introduction
source: The first step in learning Japanese is to know how to read and write. In Japan, two syllabaries are used for this: Hiragana and Katakana, called Kana, and ideograms, called Kanji. To learn kana there is no secret, you have to learn them by heart. This application aims to help you in learning kana. For that, to make the task easier there is in this application a section "lessons". It allows you to learn step by step to recognize hiragana and then katakana. It is very practical and it is advisable to repeat them. For an overview, you can go to the "hiragana" and "katakana" sections, see a particular character, know its writing, listen to its pronunciation and practice writing it. Finally a Quiz section will allow you to practice when you get to know hiragana and katakana better.
fr: Le premier pas dans l'apprentissage du japonais est de se savoir lire et écrire. Au japon on utilise pour cela deux syllabaires: les Hiragana et Katakana, appelés Kana, et les idéogrammes, appelés Kanji. Pour apprendre les Kana il n'y a pas de secret, il faut les apprendre par coeur. Cette application a pour but de vous aider dans l'apprentissage des kana. Pour cela, pour rendre la tâche plus facile il y a dans cette application une section "leçons". Elle permet d'apprendre pas à pas à reconnaître les hiragana puis les katakana. C'est très pratique et il est conseillé de les répéter. Pour un vision d'ensemble, vous pouvez aller dans les sections "hiragana" et "katakana", voir un caractère en particulier, connaître son écriture, écouter sa prononciation et vous entrainez à l'écrire. Enfin une section Quiz vous permettra de vous entrainez quand vous connaitrez mieux les hiragana et katakana.
