//
//  KanaToRomaji.swift
//  Kana Torii
//
//  Created by clément floret on 01/07/2020.
//  Copyright © 2020 Clément FLORET. All rights reserved.
//

import Foundation

let hiraganaAllToRomaji = [
    "あ": "A","い": "I","う": "U","え": "E","お": "O",
    "か": "Ka","き": "Ki","く": "Ku","け": "Ke","こ": "Ko",
    "さ": "Sa","し": "Shi","す": "Su","せ": "Se","そ": "So",
    "た": "Ta","ち": "Chi","つ": "Tsu","て": "Te","と": "To",
    "な": "Na","に": "Ni","ぬ": "Nu","ね": "Ne","の": "No",
    "は": "Ha","ひ": "Hi","ふ": "Fu","へ": "He","ほ": "Ho",
    "ま": "Ma","み": "Mi","む": "Mu","め": "Me","も": "Mo",
    "や": "Ya","ゆ": "Yu","よ": "Yo",
    "ら": "Ra","り": "Ri","る": "Ru","れ": "Re","ろ": "Ro",
    "わ": "Wa","を": "Wo",
    "ん": "N",
    "が": "Ga","ぎ": "Gi","ぐ": "Gu","げ": "Ge","ご": "Go",
    "ざ": "Za","じ": "Ji","ず": "Zu","ぜ": "Ze","ぞ": "Zo",
    "だ": "Da","ぢ": "Ji","づ": "Zu","で": "De","ど": "Do",
    "ば": "Ba","び": "Bi","ぶ": "Bu","べ": "Be","ぼ": "Bo",
    "ぱ": "Pa","ぴ": "Pi","ぷ": "Pu","ぺ": "Pe","ぽ": "Po",
    "きゃ": "Kya","きゅ": "Kyu","きょ": "Kyo",
    "しゃ": "Sha","しゅ": "Shu","しょ": "Sho",
    "ちゃ": "Cha","ちゅ": "Chu","ちょ": "Cho",
    "にゃ": "Nya","にゅ": "Nyu","にょ": "Nyo",
    "ひゃ": "Hya","ひゅ": "Hyu","ひょ": "Hyo",
    "みゃ": "Mya","みゅ": "Myu","みょ": "Myo",
    "りゃ": "Rya","りゅ": "Ryu","りょ": "Ryo",
    "ぎゃ": "Gya","ぎゅ": "Gyu","ぎょ": "Gyo",
    "じゃ": "Ja","じゅ": "Ju","じょ": "Jo",
    "びゃ": "Bya","びゅ": "Byu","びょ": "Byo",
    "ぴゃ": "Pya","ぴゅ": "Pyu","ぴょ": "Pyo"
]

let hiraganaGojuonToRomaji = [
    "あ": "A","い": "I","う": "U","え": "E","お": "O",
    "か": "Ka","き": "Ki","く": "Ku","け": "Ke","こ": "Ko",
    "さ": "Sa","し": "Shi","す": "Su","せ": "Se","そ": "So",
    "た": "Ta","ち": "Chi","つ": "Tsu","て": "Te","と": "To",
    "な": "Na","に": "Ni","ぬ": "Nu","ね": "Ne","の": "No",
    "は": "Ha","ひ": "Hi","ふ": "Fu","へ": "He","ほ": "Ho",
    "ま": "Ma","み": "Mi","む": "Mu","め": "Me","も": "Mo",
    "や": "Ya","ゆ": "Yu","よ": "Yo",
    "ら": "Ra","り": "Ri","る": "Ru","れ": "Re","ろ": "Ro",
    "わ": "Wa","を": "Wo",
    "ん": "N"
]

let hiraganaHandakuonToRomaji = [
    "が": "Ga","ぎ": "Gi","ぐ": "Gu","げ": "Ge","ご": "Go",
    "ざ": "Za","じ": "Ji","ず": "Zu","ぜ": "Ze","ぞ": "Zo",
    "だ": "Da","ぢ": "Ji","づ": "Zu","で": "De","ど": "Do",
    "ば": "Ba","び": "Bi","ぶ": "Bu","べ": "Be","ぼ": "Bo",
    "ぱ": "Pa","ぴ": "Pi","ぷ": "Pu","ぺ": "Pe","ぽ": "Po"
]

let hiraganaYoonToRomaji = [
    "きゃ": "Kya","きゅ": "Kyu","きょ": "Kyo",
    "しゃ": "Sha","しゅ": "Shu","しょ": "Sho",
    "ちゃ": "Cha","ちゅ": "Chu","ちょ": "Cho",
    "にゃ": "Nya","にゅ": "Nyu","にょ": "Nyo",
    "ひゃ": "Hya","ひゅ": "Hyu","ひょ": "Hyo",
    "みゃ": "Mya","みゅ": "Myu","みょ": "Myo",
    "りゃ": "Rya","りゅ": "Ryu","りょ": "Ryo",
    "ぎゃ": "Gya","ぎゅ": "Gyu","ぎょ": "Gyo",
    "じゃ": "Ja","じゅ": "Ju","じょ": "Jo",
    "びゃ": "Bya","びゅ": "Byu","びょ": "Byo",
    "ぴゃ": "Pya","ぴゅ": "Pyu","ぴょ": "Pyo"
]

let katakanaAllToRomaji = [
    "ア": "A","イ": "I","ウ": "U","エ": "E","オ": "O",
    "カ": "Ka","キ": "Ki","ク": "Ku","ケ": "Ke","コ": "Ko",
    "サ": "Sa","シ": "Shi","ス": "Su","セ": "Se","ソ": "So",
    "タ": "Ta","チ": "Chi","ツ": "Tsu","テ": "Te","ト": "To",
    "ナ": "Na","ニ": "Ni","ヌ": "Nu","ネ": "Ne","ノ": "No",
    "ハ": "Ha","ヒ": "Hi","フ": "Fu","ヘ": "He","ホ": "Ho",
    "マ": "Ma","ミ": "Mi","ム": "Mu","メ": "Me","モ": "Mo",
    "ヤ": "Ya","ユ": "Yu","ヨ": "Yo",
    "ラ": "Ra","リ": "Ri","ル": "Ru","レ": "Re","ロ": "Ro",
    "ワ": "Wa","ヲ": "Wo",
    "ン": "N",
    "ガ": "Ga","ギ": "Gi","グ": "Gu","ゲ": "Ge","ゴ": "Go",
    "ザ": "Za","ジ": "Ji","ズ": "Zu","ゼ": "Ze","ゾ": "Zo",
    "ダ": "Da","ヂ": "Ji","ヅ": "Zu","デ": "De","ド": "Do",
    "バ": "Ba","ビ": "Bi","ブ": "Bu","ベ": "Be","ボ": "Bo",
    "パ": "Pa","ピ": "Pi","プ": "Pu","ペ": "Pe","ポ": "Po",
    "キャ": "Kya","キュ": "Kyu","キョ": "Kyo",
    "シャ": "Sha","シュ": "Shu","ショ": "Sho",
    "チャ": "Cha","チュ": "Chu","チョ": "Cho",
    "ニャ": "Nya","ニュ": "Nyu","ニョ": "Nyo",
    "ヒャ": "Hya","ヒュ": "Hyu","ヒョ": "Hyo",
    "ミャ": "Mya","ミュ": "Myu","ミョ": "Myo",
    "リャ": "Rya","リュ": "Ryu","リョ": "Ryo",
    "ギャ": "Gya","ギュ": "Gyu","ギョ": "Gyo",
    "ジャ": "Ja","ジュ": "Ju","ジョ": "Jo",
    "ビャ": "Bya","ビュ": "Byu","ビョ": "Byo",
    "ピャ": "Pya","ピュ": "Pyu","ピョ": "Pyo"
]

let katakanaGojuonToRomaji = [
    "ア": "A","イ": "I","ウ": "U","エ": "E","オ": "O",
    "カ": "Ka","キ": "Ki","ク": "Ku","ケ": "Ke","コ": "Ko",
    "サ": "Sa","シ": "Shi","ス": "Su","セ": "Se","ソ": "So",
    "タ": "Ta","チ": "Chi","ツ": "Tsu","テ": "Te","ト": "To",
    "ナ": "Na","ニ": "Ni","ヌ": "Nu","ネ": "Ne","ノ": "No",
    "ハ": "Ha","ヒ": "Hi","フ": "Fu","ヘ": "He","ホ": "Ho",
    "マ": "Ma","ミ": "Mi","ム": "Mu","メ": "Me","モ": "Mo",
    "ヤ": "Ya","ユ": "Yu","ヨ": "Yo",
    "ラ": "Ra","リ": "Ri","ル": "Ru","レ": "Re","ロ": "Ro",
    "ワ": "Wa","ヲ": "Wo",
    "ン": "N"
]

let katakanaHandakuonToRomaji = [
    "ガ": "Ga","ギ": "Gi","グ": "Gu","ゲ": "Ge","ゴ": "Go",
    "ザ": "Za","ジ": "Ji","ズ": "Zu","ゼ": "Ze","ゾ": "Zo",
    "ダ": "Da","ヂ": "Ji","ヅ": "Zu","デ": "De","ド": "Do",
    "バ": "Ba","ビ": "Bi","ブ": "Bu","ベ": "Be","ボ": "Bo",
    "パ": "Pa","ピ": "Pi","プ": "Pu","ペ": "Pe","ポ": "Po"
]

let katakanaYoonToRomaji = [
    "キャ": "Kya","キュ": "Kyu","キョ": "Kyo",
    "シャ": "Sha","シュ": "Shu","ショ": "Sho",
    "チャ": "Cha","チュ": "Chu","チョ": "Cho",
    "ニャ": "Nya","ニュ": "Nyu","ニョ": "Nyo",
    "ヒャ": "Hya","ヒュ": "Hyu","ヒョ": "Hyo",
    "ミャ": "Mya","ミュ": "Myu","ミョ": "Myo",
    "リャ": "Rya","リュ": "Ryu","リョ": "Ryo",
    "ギャ": "Gya","ギュ": "Gyu","ギョ": "Gyo",
    "ジャ": "Ja","ジュ": "Ju","ジョ": "Jo",
    "ビャ": "Bya","ビュ": "Byu","ビョ": "Byo",
    "ピャ": "Pya","ピュ": "Pyu","ピョ": "Pyo"
]
